Tekla Open API Reference for Tekla Structures 2025
ControlPlane Constructor
Overload List
Name | Description
ControlPlane()
 Creates a new control plane instance.
The default values are as follows:
Plane = new Plane();
IsMagnetic = false;
Name = "Plane";
ControlPlane(Plane, Boolean)
 Creates a new control plane instance taking the plane and magnetism as input.
Top
See Also
Reference
ControlPlane Class
Tekla.Structures.Model Namespace